/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_strrchr.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: ogoman <ogoman@student.hive.fi>            +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2023/10/25 12:28:17 by ogoman            #+#    #+#             */
/*   Updated: 2023/10/25 12:49:53 by ogoman           ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

char	*ft_strrchr(const char *s, int c)
{
	char	*result;

	result = NULL;
	while (*s)
	{
		if (*s == (char)c)
		{
			result = (char *)s;
		}
		s++;
	}
	if (c == '\0')
	{
		return ((char *)s);
	}
	return (result);
}

// int main()
// {
//     char arr[] = "helloa world";
//     char symb = 'o';
//     char *i = ft_strrchr(arr, symb); // Изменили тип i на char *

//     if (i != NULL)
//     {
//         printf("%s\n", i); // Выводим строку, начиная с найденного символа
//     }
//     else
//     {
//         printf("Символ не найден.\n");
//     }

//     return 0;
// }

// Функция strrchr в стандартной библиотеке 
// C используется для поиска последнего вхождения 
// заданного символа в строке (массиве символов) 
// и возвращения указателя на этот символ в строке. 
// Если символ не найден, функция возвращает NULL.
